//Знакомство с языками программирования (семинары) домашнее задание №2

//Задача 1: Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.
System.Console.WriteLine("Введите целое число:");
int num = int.Parse(Console.Readline());
System.Console.WriteLine($"Число {num} кратно 7 и 23 ");